[
    {
        "username": "utvsa",
        "post_id": "C_9LyGqv1PL",
        "date_posted": "2024-09-15T23:19:56",
        "image_urls": [
            "https://instagram.fyto1-1.fna.fbcdn.net/v/t51.29350-15/459955317_1029981608624357_3206475846825570291_n.jpg?stp=dst-jpg_e35&_nc_ht=instagram.fyto1-1.fna.fbcdn.net&_nc_cat=105&_nc_ohc=afROUUnROpoQ7kNvgEmfm0c&_nc_gid=0df2022d7f534488b44ac199fbcc6a2b&edm=AOQ1c0wBAAAA&ccb=7-5&ig_cache_key=MzQ1Nzk3MTkxMDUzNTUwMDc0Nw%3D%3D.3-ccb7-5&oh=00_AYCKDWD_AMaI1VtHI5raDBQbVdI8660b8Nd0Akc81vJd-A&oe=66EF4020&_nc_sid=8b3546"
        ],
        "caption": "🌟 Exciting news!\n\n✨ UTVSA is delighted to announce that our mentee registration forms for ACCE (Anh Chi Chanh Em) mentorship program are now OPEN!\n\n🤝 With ACCE, we’re passionate about the power of mentorship. Our mission is to create meaningful connections and foster strong bonds between upper-year mentors and younger mentees.\n\n🌱As an ACCE mentee, you’ll gain access to a world of opportunities for personal and professional growth. You’ll receive guidance, support, and mentorship from enthusiastic upper-year mentors.\n\n💌 Sign ups are available from now until September 30th, in our bio!\n**(Mentee Roles are reserved for 1st and 2nd year students)\n\n————————————\n♡ °•.*🐉 🪷 🐉.*° ♡\n————————————\n\n🌟 Các bạn ơi!\n\n✨ UTVSA rất vui khi được thông báo chúng mình đã chính thức mở đơn đăng kí Mentee cho chương trình ACCE (Anh-Chị-Chanh-Em) rồi đây!\n\n🤝 Mục đích của ACCE là đem đến cho các bạn sự kết nối với những anh chị lớn hơn, nhằm mục đích tạo nên những mối quan hệ học tập gần gũi và xây dựng một cộng đồng gắn kết!\n\n🌱 Những bạn Mentee sẽ nhận được sự giúp đỡ cần thiết từ các bạn lớn có nhiều kinh nghiệm cũng như kiến thức từ nhiều lĩnh vực. Đây chắc chắn sẽ là một trải nghiệm tuyệt vời đấy!\n\n💌 Đơn đăng kí sẽ được mở từ hôm nay đến hết ngày 30 tháng 9. Các bạn có thể vào bio của tụi mình để tìm đơn nhé!\n**(Lưu ý: Vị trí này được ưu tiên cho các bạn đang học năm 1/ năm 2)"
    },
    {
        "username": "utvsa",
        "post_id": "C_ypxloPq0a",
        "date_posted": "2024-09-11T21:10:22",
        "image_urls": [
            "https://instagram.fyto1-2.fna.fbcdn.net/v/t51.29350-15/459419646_515594607780709_2511538028758359405_n.jpg?stp=dst-jpg_e35_s1080x1080&_nc_ht=instagram.fyto1-2.fna.fbcdn.net&_nc_cat=101&_nc_ohc=MhhAKuT1hCIQ7kNvgGbEmWK&edm=AOQ1c0wBAAAA&ccb=7-5&ig_cache_key=MzQ1NTAwNzU4MjUwMDg1MjA2MA%3D%3D.3-ccb7-5&oh=00_AYCDAkZk0SQ15uX4trNniBFm6QkRCOvDPXOZ60V9LSr8Cw&oe=66EF17D8&_nc_sid=8b3546",
            "https://instagram.fyto1-2.fna.fbcdn.net/v/t51.29350-15/459298514_1196772731740903_6793355500020146387_n.jpg?stp=dst-jpg_e35_s1080x1080&_nc_ht=instagram.fyto1-2.fna.fbcdn.net&_nc_cat=107&_nc_ohc=Hogjgwnn3MwQ7kNvgFM_x4e&_nc_gid=0df2022d7f534488b44ac199fbcc6a2b&edm=AOQ1c0wBAAAA&ccb=7-5&ig_cache_key=MzQ1NTAwNzU4MjYxODMzOTI2MQ%3D%3D.3-ccb7-5&oh=00_AYABFfjou8y6H-aUX6Y1IGOXrNkwYpYpd-veWaBN4hfV7A&oe=66EF12C5&_nc_sid=8b3546",
            "https://instagram.fyto1-1.fna.fbcdn.net/v/t51.29350-15/459204893_1537178353829820_1670804708837071336_n.jpg?stp=dst-jpg_e35_s1080x1080&_nc_ht=instagram.fyto1-1.fna.fbcdn.net&_nc_cat=100&_nc_ohc=KOglwhFm4UgQ7kNvgHuWK4r&_nc_gid=0df2022d7f534488b44ac199fbcc6a2b&edm=AOQ1c0wBAAAA&ccb=7-5&ig_cache_key=MzQ1NTAwNzU4Mjc2OTM3Nzk5MQ%3D%3D.3-ccb7-5&oh=00_AYCWNCQ6Bv7MKSARkheUhQTRAaajdSxz5I-PyYWhrSv8rg&oe=66EF228E&_nc_sid=8b3546",
            "https://instagram.fyto1-1.fna.fbcdn.net/v/t51.29350-15/459421771_1496119945120157_6492183373198842167_n.jpg?stp=dst-jpg_e35_s1080x1080&_nc_ht=instagram.fyto1-1.fna.fbcdn.net&_nc_cat=105&_nc_ohc=vcbrFDT5C7kQ7kNvgESQTbD&edm=AOQ1c0wBAAAA&ccb=7-5&ig_cache_key=MzQ1NTAwNzU4MjQ5MjQ1MzY1NA%3D%3D.3-ccb7-5&oh=00_AYDy9_B_gar4ZSjy0R2Wiqd7hiOSbyxsghpyfXsxjNCIwQ&oe=66EF1237&_nc_sid=8b3546"
        ],
        "caption": "UTVSA Merch Sale! ✨🐉🪷\n\nThe wait is over – our UTVSA merch is here! \n\nThis year’s exclusive UTVSA merch design is more than just a tote bag or tee—it’s a symbol of our pride, culture, and heritage. Our mascot, a blue dragon, is seen enjoying a bowl of pho, a dish that’s not only a staple of Vietnamese cuisine but a representation of warmth, community, and tradition. 🐉🍜 \n\nThe dragon embodies strength, unity, and the vibrant spirit of Vietnamese culture, while pho connects us to our roots, bringing people together across generations. Through this design, we aim to celebrate and share our culture with our UofT community, reminding everyone of the beauty and richness of Vietnam’s heritage. 🪷✨\n\nMoreover, we’re proud to announce that 100% of the profits from this year’s merch sale will be donated to the Children’s Education Foundation, a charity dedicated to helping girls from impoverished and marginalized communities complete their education, offering them a future filled with independence, dignity, and opportunity. 🫶\n\nEvery purchase helps make a difference, not just in our UTVSA community, but in the lives of young, hard-working women. \n\nLink in our bio for purchase! \n\nQuestions? Shoot us a DM! 😊 \n\n♡ °•.*🐉 🪷 🐉.*° ♡\n\nCảm ơn các bạn đã đóng góp ý kiến cho merch năm nay của UTVSA. Chúng mình rất vui khi được thông báo là merch đã chính thức được ra mắt! 🐉✨\n\nThiết kế của những chiếc áo và túi được lấy ý tưởng từ chính logo của chúng mình, là hình ảnh một con rồng mạnh mẽ cùng một tô phở. 🐉🍜\n\nCon rồng tượng trưng cho sức mạnh, sự đoàn kết và tinh thần đoàn kết của người Việt Nam, trong khi phở kết nối chúng ta với cội nguồn qua ẩm thực. Qua thiết kế này, UTVSA muốn chia sẻ văn hoá của mình với các bạn ở UofT, nhắc nhở mọi người về sự phong phú của di sản Việt Nam. \n\nNgoài ra, chúng mình cũng muốn đóng góp một phần nhỏ vào Children's Education Foundation, một tổ chức từ thiện ở Việt Nam với mục tiêu giúp đỡ các bạn trẻ từ những vùng khó khăn, có cơ hội được học tập tốt hơn. Khi các bạn mua merch này, UTVSA sẽ đóng góp 100% lợi nhuận vào tổ chức này. 🫶\n\nNếu có câu hỏi các bạn có thể nhắn tin cho chúng mình nhé! 😊"
    },
    {
        "username": "utvsa",
        "post_id": "C_stpNoRkzR",
        "date_posted": "2024-09-09T13:48:44",
        "image_urls": [
            "https://instagram.fyto1-1.fna.fbcdn.net/v/t51.29350-15/459092678_500455115957216_1997172356687013043_n.jpg?stp=dst-jpg_e35&_nc_ht=instagram.fyto1-1.fna.fbcdn.net&_nc_cat=108&_nc_ohc=QpaMtDWwemUQ7kNvgHvlmob&_nc_gid=0df2022d7f534488b44ac199fbcc6a2b&edm=AOQ1c0wBAAAA&ccb=7-5&ig_cache_key=MzQ1MzMzNTc1NDQxMDI2MjQ4OQ%3D%3D.3-ccb7-5&oh=00_AYBb2-xOz3XfIB6RCLMZ-DrBHqjSABIzIZqd-y2gODdu2w&oe=66EF258A&_nc_sid=8b3546",
            "https://instagram.fyto1-2.fna.fbcdn.net/v/t51.29350-15/458289643_363912196795627_712863315309352674_n.jpg?stp=dst-jpg_e35&_nc_ht=instagram.fyto1-2.fna.fbcdn.net&_nc_cat=107&_nc_ohc=m-FctHzJ_1gQ7kNvgGB32nt&_nc_gid=0df2022d7f534488b44ac199fbcc6a2b&edm=AOQ1c0wBAAAA&ccb=7-5&ig_cache_key=MzQ1MzMzNTc1NDM0MzA2MTYxNw%3D%3D.3-ccb7-5&oh=00_AYC924z_B3AKBSEB3YAfEtO1Qxnj2qBiK40NBe76oKbeaA&oe=66EF3D2D&_nc_sid=8b3546"
        ],
        "caption": "🙋🏻‍♂️ Hey there!\n\n🎊 UTVSA welcomes vou back to another year of the ACCE Mentorship Program!\n\n📩 Sign-ups are now available for Mentors! If you’re enthusiastic about guiding and supporting newcomers at U of T, this program offers the perfect opportunity for you to make a difference.\n\n🧑🏻‍🏫 For those unfamiliar with the ACCE (Anh Chi Chanh Em) Mentorship program, our goal is to pair first- and second-year students with their more experienced counterparts in their third or fourth year. Through these\npairings, we aim to foster strong bonds that cultivate friendship, academic growth, and a deeper sense of community within the UTVSA Community. ♡\n\n📝 Sign ups are available from now until September 29th, in our bio!\n\n‼️ Stay tune if you wish to be a mentee, as sign ups will be available later on!\n\n————————————\n♡ °•.*🐉 🪷 🐉.*° ♡\n————————————\n\n🙋🏻‍♂️ Các bạn ơi!\n\n🎊 UTVSA vui mừng chào đón sự trở lại của chương trình cố vấn ANH-CHỊ-CHANH-EM (ACCE)!\n\n📩 Đơn đăng ký dành cho các bạn Mentors đã được mở bắt đầu từ hôm nay! Nếu bạn có ý định thử sức với vai trò này thì đừng ngần ngại đăng kí nhé! Đây sẽ là một cơ hội để giúp đỡ những thành viên mới của U of T, cũng như tạo nên sự phát triển thông qua các thay đổi tích cực.\n\n🧑🏻‍🏫 ACCE là một chương trình kết nối nhằm bắt cặp các anh chị (sinh viên năm 3-4) với các em nhỏ hơn (sinh viên năm 1-2). Qua sự “mai mối” này, chúng mình mong rằng sẽ xây dựng được những tình bạn tốt đẹp, mối quan hệ học tập gần gũi, đồng thời tạo nên một cộng đồng gắn kết hơn ở U of T và UTVSA. ♡\n\n📝 Đơn đăng kí dành cho Mentors sẽ được mở từ hôm nay (10 tháng 9) cho đến hết ngày 29 tháng 9, link ở trong bio của chúng mình!\n\n‼️ Lưu ý, đây là mẫu đơn dành cho Mentors. Các bạn với mong muốn trở thành Mentees hãy đợi tin từ chúng mình nhé!"
    }
]