[
    {
        "title": "UEFA EURO 2024 Viewing Party",
        "summary": "Join UOFT ASU, AAY, and SoccerWorld at YorkU to cheer on the national team during their third game at UEFA EURO 2024.",
        "date": "June 24th",
        "location": "Rivals Sports Pub, YorkU",
        "time": "2:30 P.M."
    },
    {
        "title": "ASU Executive Team Nominations and Voting Event",
        "date": "May 13",
        "location": "Online",
        "time": null,
        "summary": "The ASU Executive Team nominations are now open for the 2024-2025 academic year. The nomination period runs from May 13 to May 21 at 11:59 P.M. The voting period will be from May 22 to May 28, with winners announced on May 30. An End of Year Barbecue will be held on May 16 at Downsview Park for inquiries. Interested individuals can fill out the Google Form linked in the bio to run for positions or join as a General Member."
    },
    {
        "title": "End of Year Barbecue Celebration",
        "date": "Thursday, May 16",
        "location": "Downsview Park at the Lake",
        "time": "6:00 P.M. until sunrise",
        "summary": "Celebrate the end of the academic year with a barbecue event at Downsview Park. Join us for food, music, games, and good vibes. Feel free to bring your own snacks and beverages. Don't forget to fill out the registration form to ensure there's enough food and fun for everyone!"
    },
    {
        "title": "Sales Support Specialist Internship Opportunity in Hungary",
        "date": "May 1, 2024",
        "location": "Hungary",
        "time": null,
        "summary": "AIESEC is offering an internship opportunity in Hungary for a Sales Support Specialist. The role involves community development, analytical thinking, client servicing, and business intelligence. Apply by April 10, 2024. Gain practical experience and create memories in a new environment. Check the link in the bio for more information."
    },
    {
        "title": "Internship Opportunity in Greece: Guest Relations & Social Media Manager",
        "summary": "AIESEC is offering an internship opportunity in Greece for a Guest Relations & Social Media Manager. Gain practical experience in social media management, graphics and design, and content marketing. Travel the world while expanding your network.",
        "date": {
            "start": "1SEP, 2024",
            "end": "31 OCT, 2024",
            "apply_by": "28 AUG, 2024"
        },
        "location": "Greece",
        "time": null
    },
    {
        "title": "AIESEC Group Consultation for Internships Abroad",
        "date": "February 7th",
        "location": "Sidney Smith Room 2119",
        "time": "5-6 PM",
        "summary": "AIESEC is hosting a group consultation for all those interested in learning more about internships. Come prepared with any questions you have, and join us to spearhead your professional development."
    },
    {
        "title": "University of Toronto Undergraduate Research Fair",
        "date": "April 28",
        "location": "OISE Building (Room G162)",
        "time": "12:00 PM - 5:00 PM",
        "summary": "Join the University of Toronto Undergraduate Research Fair featuring disciplines like Pathobiology, Psychology, Molecular Biology, Mechanobiology, Astronomy, Chemistry, and Immunology. Special speaker Dr. Jennifer Mitchell will give an opening speech on genome functions in stem cells. The event includes 7 oral presentations, 11 poster presentations, and a $100 raffle. Free admission sponsored by the Student Initiative Fund. Don't miss this opportunity to connect with fellow undergraduate researchers!"
    },
    {
        "title": "AMOSP X URSA Research Fair: Undergraduate Research Networking Event",
        "date": "January 31, 2023",
        "location": "University of Toronto",
        "time": null,
        "summary": "The AMOSP X URSA Research Fair is a networking event for undergraduate researchers in STEM fields. It provides an opportunity for students to present their research projects at a symposium, create posters, connect with other researchers, and potentially win awards. Abstract submissions are open to researchers of all disciplines and project stages. Deadline for project submission is January 31, 2023."
    },
    {
        "title": "ACE UTSG Panel Talk & Networking: Exploring Capital Markets",
        "date": "March 7th, 2024",
        "location": "OISE 2214",
        "time": "6:30-8:30pm",
        "summary": "Join ACE UTSG for a panel talk and networking session focused on exploring capital markets. Learn from industry professionals in risk management, machine learning, and valuation. Limited spots available, don't miss out!"
    },
    {
        "title": "ACE UofT Invitationals Q&A Event",
        "date": "November 25th",
        "location": "University College",
        "time": null,
        "summary": "ACE UofT Invitationals Q&A event where questions regarding the competition are answered. The event is scheduled for November 25th at University College. Registration is closed, and case assignments have been sent out. Participants are encouraged to DM for any further inquiries. Good luck to all competitors!"
    },
    {
        "title": "ACE UofT Invitationals",
        "date": {
            "start": "November 25th",
            "end": null
        },
        "location": "University College, UofT",
        "time": {
            "start": null,
            "end": null
        },
        "summary": "The ACE UofT Invitationals offer participants the opportunity to network with industry professionals from EY and MMPA, practice case competition skills, meet like-minded people from all three UofT campuses, boost confidence, and win amazing prizes. The competition is scheduled for Saturday, November 25th, with the registration deadline on Wednesday, November 22nd at 11:59pm."
    },
    {
        "title": "ACE UofT Invitationals by Ernst & Young and MMPA",
        "summary": "Prepare for ACE Nationals with individual or team case challenges sponsored by Ernst & Young and MMPA. Registration deadline is November 21st. Build your network and unleash your professional potential at University College on November 25th.",
        "date": "Saturday, November 25th",
        "location": "University College",
        "time": "10:30 AM - 5:00 PM"
    },
    {
        "title": "Alumni Reunion 2023 at WA UNI ITY COLLEGE",
        "summary": "Join us for an engaging and enlightening info session with guest Olivia Wang.",
        "date": "June 3, 2023",
        "location": "WA UNI ITY COLLEGE",
        "time": "9:00 PM EST"
    },
    {
        "title": "RSUNION: Architecture & Visual Studies Info Session",
        "summary": "Join the RSUNION event to gain connections for your future career. This info session on June 3, 2023, at 9:00 PM EST is open to all students and enthusiasts interested in architecture and visual studies. Learn from industry experts, expand your knowledge, and network with like-minded individuals.",
        "date": "June 3, 2023",
        "time": "9:00 PM EST",
        "location": "Zoom (link coming soon)"
    },
    {
        "title": "Architecture Info Session for Daniels Students and Enthusiasts",
        "summary": "Join an engaging and enlightening info session to expand knowledge and gain insights for future careers. Learn from architecture industry experts and connect with like-minded individuals. Open to all students and enthusiasts.",
        "date": "June 3, 2023",
        "time": "9:00 PM EST",
        "location": "Zoom (link coming soon)"
    }
]