[
    {
        "title": "Kuq E Zi Style Event at Rivals Sports Pub",
        "date": null,
        "location": "Rivals Sports Pub",
        "time": null,
        "summary": "An event held at Rivals Sports Pub in Kuq E Zi style to support the boys. Attendees enjoyed good company and ice cold drinks despite the match outcome. Looking forward to the next gathering!"
    },
    {
        "title": "UEFA EURO 2024 Viewing Party",
        "summary": "Join UOFT ASU, AAY, and SoccerWorld at YorkU to cheer on the national team during their third game at UEFA EURO 2024.",
        "date": "June 24th",
        "location": "Rivals Sports Pub, YorkU",
        "time": "2:30 P.M."
    },
    {
        "title": "UEFA EURO 2024 Viewing Party: Italia",
        "date": "June 15th",
        "location": "Rivals Sports Pub",
        "time": "2:30 P.M."
    },
    {
        "title": "Celebrating the 2023-2024 Academic Year",
        "summary": "A celebration of the past academic year with various events including conferences, panels, picnics, pub crawls, and more, looking forward to continuing to build community.",
        "date": null,
        "location": null,
        "time": null
    },
    {
        "title": "ASU 2024/2025 Executive Team Voting",
        "date": "Tuesday May 28th, 2024",
        "location": null,
        "time": null,
        "summary": "Voting for the ASU 2024/2025 Executive Team is now open to all registered UofT students. The voting ballot can be accessed through the Instagram bio. Good luck to all candidates!"
    },
    {
        "title": "End-of-Year BBQ Celebration with Albanian Society at University of Toronto",
        "date": null,
        "location": null,
        "time": null,
        "summary": "The event was an End-of-Year BBQ celebration organized in collaboration with the Albanian Society at University of Toronto. It was a gathering to appreciate the community's support and love for the culture. The AAY 2023-2024 Executive Team expressed gratitude to everyone who attended."
    },
    {
        "title": "ASU Executive Team Nominations and Voting Event",
        "date": "May 13",
        "location": "Online",
        "time": null,
        "summary": "The ASU Executive Team nominations are now open for the 2024-2025 academic year. The nomination period runs from May 13 to May 21 at 11:59 P.M. The voting period will be from May 22 to May 28, with winners announced on May 30. An End of Year Barbecue will be held on May 16 at Downsview Park for inquiries. Interested individuals can fill out the Google Form linked in the bio to run for positions or join as a General Member."
    },
    {
        "title": "End of Year Barbecue Celebration",
        "date": "Thursday, May 16",
        "location": "Downsview Park at the Lake",
        "time": "6:00 P.M. until sunrise",
        "summary": "Celebrate the end of the academic year with a barbecue event at Downsview Park. Join us for food, music, games, and good vibes. Feel free to bring your own snacks and beverages. Don't forget to fill out the registration form to ensure there's enough food and fun for everyone!"
    },
    {
        "title": "ASU Executive Member Applications Opening Event",
        "date": "May 13, 2024",
        "location": null,
        "time": null,
        "summary": "Join the ASU Executive team by applying for the upcoming academic year! Show your enthusiasm and ideas by becoming a part of the team. Application form will be posted on May 13, 2024. General members are also encouraged to join to help secure benefits for future events."
    },
    {
        "title": "ACLA Legal Career Panel Recap",
        "date": null,
        "location": null,
        "time": null,
        "summary": "A recap and thank you message for the Legal Career Panel hosted by the Albanian Canadian Lawyers Association. The event featured insightful conversations and engaging discussions with panelists, including the association's President, Ensi Çullhaj, who also served as a moderator. Attendees were encouraged to provide feedback for future events.",
        "caption": "Thank you to everyone who joined us for our Legal Career Panel a few weeks ago. We were so happy to see you all there and hope that you found the event as enjoyable as we had hoped! We would especially like to thank the Albanian Canadian Lawyers Association as well as all of our panelists. We are also very proud of our President, Ensi Çullhaj who served as one of the moderators at the event. So many great conversations were had and thoughtful questions were answered. If you enjoyed the panel as an attendee and would like to see more events like these please let us know!"
    },
    {
        "title": "AIESEC International Opportunities Showcase",
        "events": [
            {
                "type": "Internship",
                "summary": "Develop your leadership skills and boost your career prospects with an international internship in your field. Gain multicultural work experience, find the right industry for you, and enhance your professional edge.",
                "date": null,
                "location": "Various countries",
                "time": null
            },
            {
                "type": "Teaching Abroad",
                "summary": "Enhance your leadership abilities and career growth by working as a teacher abroad. Immerse yourself in a cross-cultural environment, explore new skills, and gain a competitive edge.",
                "date": null,
                "location": "Various countries",
                "time": null
            },
            {
                "type": "Volunteering",
                "summary": "Cultivate your leadership skills through a volunteering project that contributes to Sustainable Development. Experience diverse cultures, make a positive impact, and challenge yourself.",
                "date": null,
                "location": "Various countries",
                "time": null
            }
        ]
    },
    {
        "title": "AIESEC Internship Opportunities Event",
        "summary": "AIESEC offers a wide network of internship opportunities across various fields, allowing students to develop professional skills in a multicultural setting. Gain a global mindset and distinctive experience through international exchange and volunteer opportunities. Build and grow leadership skills by practical experiences, standing out and making an impact.",
        "date": null,
        "location": null,
        "time": null
    },
    {
        "title": "AIESEC in Toronto: Global Internship Opportunities and Professional Development",
        "date": null,
        "location": null,
        "time": null,
        "summary": "AIESEC in Toronto offers UoFT students support in finding internships or volunteering opportunities, 1 on 1 consultations, professional workshops, seminars, leadership and skill development programs. Students can gain practical workplace experiences, develop leadership skills, build a global network, and learn about different cultures. AIESEC provides networking opportunities, internships abroad, resume building, and access to a global student network. Get involved with AIESEC today to make an impact.",
        "caption": "How AIESEC in Toronto helps students at UoFT: Networking, Internships abroad, Building resumes, Joining a global network of students, and connecting with professionals. Check out the link in the bio for more information. #withaiesec"
    },
    {
        "title": "AIESEC in Toronto March Local Committee Meeting",
        "summary": "AIESEC in Toronto hosted their March local committee meeting, expressing gratitude to their team members.",
        "date": "null",
        "location": "Toronto",
        "time": "null"
    },
    {
        "title": "Sales Support Specialist Internship Opportunity in Hungary",
        "date": "May 1, 2024",
        "location": "Hungary",
        "time": null,
        "summary": "AIESEC is offering an internship opportunity in Hungary for a Sales Support Specialist. The role involves community development, analytical thinking, client servicing, and business intelligence. Apply by April 10, 2024. Gain practical experience and create memories in a new environment. Check the link in the bio for more information."
    },
    {
        "title": "Internship Opportunities in Software Development and Economics",
        "summary": "AIESEC Toronto is offering internship opportunities in Software Development and Economics. Swipe to learn more and sign up by visiting the link in their bio.",
        "date": {
            "Software Development": {
                "start": "15 JUL",
                "end": "26 AUG 2024"
            },
            "Economics": {
                "start": "30 JUN",
                "end": "30 JUN 2024"
            }
        },
        "location": null,
        "time": null
    },
    {
        "title": "Internship Opportunity in Brazil with AIESEC",
        "summary": "Join AIESEC for an internship opportunity in Brazil to develop leadership skills, belong to a global team, and build a global network. Apply before July 31, 2024, and begin the internship from August 1, 2024, to August 1, 2025.",
        "date": null,
        "location": "Brazil",
        "time": null
    },
    {
        "title": "Internship Opportunity in Greece: Guest Relations & Social Media Manager",
        "summary": "AIESEC is offering an internship opportunity in Greece for a Guest Relations & Social Media Manager. Gain practical experience in social media management, graphics and design, and content marketing. Travel the world while expanding your network.",
        "date": {
            "start": "1SEP, 2024",
            "end": "31 OCT, 2024",
            "apply_by": "28 AUG, 2024"
        },
        "location": "Greece",
        "time": null
    },
    {
        "title": "AIESEC Exchange Opportunity Information Session",
        "date": null,
        "location": null,
        "time": null,
        "summary": "Join AIESEC for an information session about an exchange opportunity in Germany. Learn more about available positions and how to get involved. Visit the link in the bio for more details.",
        "caption": "HEY AIESEC! Looking for an awesome exchange opportunity in Germany? Look no further because we do! Read all about it in this post and head to the link in our bio for more information (: #joinaiesec #withaiesec #internationalexchangeinternship"
    },
    {
        "title": "AIESEC Group Consultation for Internships Abroad",
        "date": "February 7th",
        "location": "Sidney Smith Room 2119",
        "time": "5-6 PM",
        "summary": "AIESEC is hosting a group consultation for all those interested in learning more about internships. Come prepared with any questions you have, and join us to spearhead your professional development."
    },
    {
        "title": "Podcast Interview with Dr. Kenneth Yip",
        "date": null,
        "location": null,
        "time": null,
        "summary": "Tune in to listen to an interview with Dr. Kenneth Yip, an assistant professor at UofT and a prominent cancer researcher at Princess Margaret Cancer Centre. The podcast is hosted by Daphne Jiang, Clara Han, and edited by Fiona Xu.",
        "spotify_link": "Link in bio"
    },
    {
        "title": "University of Toronto Undergraduate Research Fair",
        "date": null,
        "location": "University of Toronto",
        "time": null,
        "summary": "An event showcasing undergraduate research projects in various fields including Pathobiology, Psychology, Molecular Biology, Mechanobiology, Astronomy, Chemistry, and Immunology. Presenters will discuss their projects ranging from investigating tissue contraction mechanisms to detecting exoplanets and developing biosensors for early cancer diagnosis.",
        "caption": "✨️GET READY PPL for some amazing presentations at our Undergrad Research Fair!! ➡️All our lovely presenters and their project descriptions are listed here. Everyone is tagged in case you ever want to reach out!! 📝From molecular bio to chemistry to astrophysics, we have a wide selection of research areas we'll be touching on!! See you all there!! 🏃‍♀️🏃‍♂️SIGN UP LINK BIO🔗"
    },
    {
        "title": "University of Toronto Undergraduate Research Fair",
        "date": "April 28",
        "location": "OISE Building (Room G162)",
        "time": "12:00 PM - 5:00 PM",
        "summary": "Join the University of Toronto Undergraduate Research Fair featuring disciplines like Pathobiology, Psychology, Molecular Biology, Mechanobiology, Astronomy, Chemistry, and Immunology. Special speaker Dr. Jennifer Mitchell will give an opening speech on genome functions in stem cells. The event includes 7 oral presentations, 11 poster presentations, and a $100 raffle. Free admission sponsored by the Student Initiative Fund. Don't miss this opportunity to connect with fellow undergraduate researchers!"
    },
    {
        "title": "AMOSP SEASON 2 Podcast with Dr. William Navarre",
        "date": null,
        "location": null,
        "time": null,
        "summary": "Join the new podcast episode featuring Dr. William Navarre, Associate Professor in the Department of Molecular Genetics at the University of Toronto. Explore his research on the microbiome and the use of mice as a model organism. Discover insights on research interests, studying multiple models, nutritional conditions, and get tips for students. Don't miss finding out Dr. Navarre's favorite scientist!",
        "caption": "The new podcast with Dr. William Navarre is out! To learn about his research on the microbiome and using mice as a model organism, simply click the link to our YouTube in our bio! And as always, watch to find out who Dr. Navarre's favourite scientist is and why!"
    },
    {
        "title": "Molecular Genetics Department Event",
        "date": null,
        "location": null,
        "time": null,
        "summary": "Join us for a guessing game to figure out the next featured guest in the Molecular Genetics Department!",
        "caption": "#GuesstheGuest! 💡"
    },
    {
        "title": "Podcast Episode with Dr. David Jenkins",
        "date": null,
        "location": null,
        "time": null,
        "summary": "Listen to a podcast episode featuring Dr. David Jenkins, a Professor in the department of Nutritional Sciences at the University of Toronto. Dr. Jenkins discusses his research interests, the role of diet in human metabolism and diseases like diabetes, lessons learned as a student, barriers in Nutritional Sciences research, and more. Don't miss out on this insightful conversation!",
        "link": "Check out the link in the bio to listen."
    },
    {
        "title": "Guess the Next Guest Event",
        "summary": "Join us for an exciting event where you can guess who our next guest will be!",
        "date": null,
        "location": null,
        "time": null
    },
    {
        "title": "Podcast with Dr. Jennifer Mitchell, University of Toronto",
        "date": null,
        "location": "University of Toronto",
        "time": null,
        "summary": "Tune in to the podcast featuring Dr. Jennifer Mitchell, a professor in the Department of Cell and Systems Biology at the University of Toronto. The episode provides insights into the field of Cell and System Biology. Check out the link in the bio to listen!"
    },
    {
        "title": "AMOSP X URSA Research Fair: Undergraduate Research Networking Event",
        "date": "January 31, 2023",
        "location": "University of Toronto",
        "time": null,
        "summary": "The AMOSP X URSA Research Fair is a networking event for undergraduate researchers in STEM fields. It provides an opportunity for students to present their research projects at a symposium, create posters, connect with other researchers, and potentially win awards. Abstract submissions are open to researchers of all disciplines and project stages. Deadline for project submission is January 31, 2023."
    },
    {
        "title": "AMOSP Season 2 Episode 13: Podcast with Dr. Jennifer Mitchell",
        "date": null,
        "location": "University of Toronto",
        "time": null,
        "summary": "Join the podcast episode featuring Dr. Jennifer Mitchell, a Professor in the Department of Cell & Systems Biology at the University of Toronto. Explore Dr. Mitchell's research journey, discuss enhancer activity in embryonic stem cells, debunk misconceptions in genomic and developmental biology, and delve into the ethical aspects of research. Gain insights into potential research directions and receive tips for aspiring students. Don't miss out on this informative discussion!",
        "caption": "The new podcast with Dr. Jennifer Mitchell is out! Learn more about genomic and developmental biology research with our guest! The link to our YouTube in our bio!"
    },
    {
        "title": "Join Our Team as Vice President or Co-President",
        "date": null,
        "location": null,
        "time": null,
        "summary": "Join us in our recruitment drive for Vice President roles and Co-President. Visit the link in our bio to apply today. Explore the role descriptions available in the link to understand the responsibilities of each position.",
        "link": "linktr.ee/aceutsg",
        "website": "www.aceutsg.org"
    },
    {
        "title": "ACE UTSG (DECA UTSG) Vice President Recruitment 2024-2025",
        "date": "Sunday, June 30th",
        "location": "ACE UTSG (DECA UTSG)",
        "time": "11:59 PM"
    },
    {
        "title": "ACEUTSG Student Elections 2025",
        "date": {
            "start": "2025-06-01",
            "end": "2025-06-11"
        },
        "location": null,
        "time": null,
        "summary": "Attention UTSG students! ACEUTSG elections will be held from June 1st, 2025 to June 10th, 2025. Nominate yourself to be a part of the leadership team by accessing the nomination form at linktr.ee/aceutsg. Seize this opportunity to make a difference!"
    },
    {
        "title": "Capital Markets Event Panel Announcement",
        "date": "null",
        "location": "null",
        "time": "6:30pm",
        "summary": "Join us for a capital markets event featuring Vincent Yang, Angie An, Henry Wu, and Hank Xiong as they share insights on risk management, deals valuation, machine learning development, and portfolio construction. Don't miss out on this opportunity to learn from these industry professionals. Sign up through the link in our bio!"
    },
    {
        "title": "ACE UTSG Panel Talk & Networking: Exploring Capital Markets",
        "date": "March 7th, 2024",
        "location": "OISE 2214",
        "time": "6:30-8:30pm",
        "summary": "Join ACE UTSG for a panel talk and networking session focused on exploring capital markets. Learn from industry professionals in risk management, machine learning, and valuation. Limited spots available, don't miss out!"
    },
    {
        "title": "Event Check-in",
        "date": null,
        "location": null,
        "time": null,
        "summary": "Event check-in post."
    },
    {
        "title": "ACE UofT Tri-campus Invitational Venue Route Guide",
        "date": null,
        "location": "UofT Tri-campus",
        "time": null,
        "summary": "The ACE UofT Tri-campus Invitational Venue Route Guide event will take place at the University of Toronto's Tri-campus. Get ready to explore the route and prepare for the invitational event!"
    },
    {
        "title": "ACE UofT Invitationals Q&A Event",
        "date": "November 25th",
        "location": "University College",
        "time": null,
        "summary": "ACE UofT Invitationals Q&A event where questions regarding the competition are answered. The event is scheduled for November 25th at University College. Registration is closed, and case assignments have been sent out. Participants are encouraged to DM for any further inquiries. Good luck to all competitors!"
    },
    {
        "title": "ACE UofT Invitationals",
        "date": {
            "start": "November 25th",
            "end": null
        },
        "location": "University College, UofT",
        "time": {
            "start": null,
            "end": null
        },
        "summary": "The ACE UofT Invitationals offer participants the opportunity to network with industry professionals from EY and MMPA, practice case competition skills, meet like-minded people from all three UofT campuses, boost confidence, and win amazing prizes. The competition is scheduled for Saturday, November 25th, with the registration deadline on Wednesday, November 22nd at 11:59pm."
    },
    {
        "title": "ACE UofT Invitationals by Ernst & Young and MMPA",
        "summary": "Prepare for ACE Nationals with individual or team case challenges sponsored by Ernst & Young and MMPA. Registration deadline is November 21st. Build your network and unleash your professional potential at University College on November 25th.",
        "date": "Saturday, November 25th",
        "location": "University College",
        "time": "10:30 AM - 5:00 PM"
    },
    {
        "title": "Exploring Offroad Robotics Research at UTIAS",
        "summary": "Discover how PhD student Alexander Krawciw is advancing offroad robotics at UTIAS, under the mentorship of Professor Tim Barfoot, with a focus on smarter and safer autonomous systems in unpredictable terrains. His achievements include earning the prestigious Vanier Canada Graduate Scholarship.",
        "date": null,
        "location": null,
        "time": null
    },
    {
        "title": "Exploring Radiation Magnetohydrodynamics: A Research Endeavor by Professor Clinton Groth",
        "summary": "Professor Clinton Groth has been selected as the recipient of @uoftengineering's Joint Seed Program for his research in radiation magnetohydrodynamics. Collaborating with Bart Ripperda, the project aims to uncover parallels between black hole emissions and solar phenomena, enhancing our knowledge of astrophysical systems and their interactions with the cosmos.",
        "date": null,
        "location": null,
        "time": null
    },
    {
        "title": "Revolutionizing Self-Driving Cars with SWTrack AI",
        "date": null,
        "location": "UTIAS",
        "time": null,
        "summary": "Professor Waslander and his team at UTIAS are developing SWTrack, a new AI for self-driving cars that can predict pedestrian and cyclist movements even when they are hidden from sight. SWTrack uses the past five seconds of information to enhance the car's situational awareness, enabling safer decision-making. Visit our bio link to learn more about this groundbreaking technology."
    },
    {
        "title": "UTIAS 75th Anniversary Celebration",
        "date": null,
        "location": null,
        "time": null,
        "summary": "UTIAS is celebrating its 75th Anniversary with a microsite that showcases its history of excellence in aerospace and robotics research. Share your UTIAS story to inspire the next generation of aerospace pioneers by submitting it through the blog section on the bio link.",
        "caption": "The 75th Anniversary microsite documents our history of excellence. 🎖 It not only shows the foundation of excellence upon which UTIAS was built, but it shows the continuum of excellence that has kept UTIAS at the forefront of aerospace and robotics research. Did UTIAS shape your career? Do you have a fond memory from your time here? Your story could inspire the next generation of aerospace pioneers. Submit your story today! It's easy - go to our bio link, select the blog section, and click the submission button. We can't wait to hear from you."
    },
    {
        "title": "UofTEngineering Students Launch HERON Mk. II Satellite into Orbit",
        "summary": "The UofTEngineering students from the Space Systems division successfully launched the HERON Mk. II satellite into orbit using a Falcon 9 rocket. Learn more about their achievement and future plans.",
        "date": null,
        "location": "Bahen Centre, University of Toronto",
        "time": null
    },
    {
        "title": "Winter Aerospace Studies Event in Toronto",
        "date": null,
        "location": "Toronto",
        "time": null,
        "summary": "Experience the winter vibes in the world of aerospace at this event in Toronto, where innovation meets frosty inspiration. Join us for a unique exploration of the intersection between technology and the winter season. ❄️⁠"
    },
    {
        "title": "HERON Mk. II Satellite Mission by UofT Aerospace Team",
        "summary": "Learn about Canada's first fully student-funded and student-developed satellite mission, HERON Mk. II, which was launched into space on November 11, 2023, aboard a SpaceX Falcon9 rocket. The mission involved over 100 students and aimed to demonstrate UTAT’s radio communications capabilities, along with validating various system designs. This success has paved the way for UTAT's next mission, FINCH, set to launch in late 2025.",
        "date": "November 11, 2023",
        "location": null,
        "time": null
    },
    {
        "title": "UTIAS and Siemens Collaboration for Sustainable Propulsion and Power Generation",
        "summary": "UTIAS teams up with Siemens to develop sustainable propulsion and power generation. Led by Professor S. Chaudhuri, the research redefines gas turbine engines to reduce carbon emissions in aviation and fuel consumption. The collaboration aims to build a comprehensive understanding for creating fuel-flex gas turbine engines.",
        "date": null,
        "location": null,
        "time": null
    },
    {
        "title": "UTIAS Holiday Party Celebration",
        "date": null,
        "location": "UTIAS cafeteria",
        "time": null,
        "summary": "The UTIAS community wishes everyone happy holidays and expresses gratitude to the ASA team for decorating the cafeteria for the holiday party."
    },
    {
        "title": "Unlocking Canada's Potential in Sustainable Aviation",
        "date": null,
        "location": null,
        "time": null,
        "summary": "Join us to explore Professor David Zingg's insights on replacing fossil fuels with sustainable energy and revolutionizing aircraft efficiency. Discover the hidden potential of next-gen aircraft designs and learn how Canada can lead the charge in the global pursuit of sustainable aviation. Read more from The Hill Times article linked on our website."
    },
    {
        "title": "Daniels Faculty Student-Operated Printing Lab Event",
        "summary": "Experience rapid and professional 3D printing solutions at the Daniels Faculty Student-Operated Printing Lab. The lab features FDM and SLA printers catering specifically to the needs of architecture students known for their excellence.",
        "date": null,
        "location": "Daniels Faculty Printing Lab",
        "time": null
    },
    {
        "title": "RSUNION: Virtual Networking Event for Architecture and Visual Studies Students",
        "date": "June 3, 2023",
        "location": null,
        "time": "9:00 PM EST"
    },
    {
        "title": "Alumni Reunion 2023 at WA UNI ITY COLLEGE",
        "summary": "Join us for an engaging and enlightening info session with guest Olivia Wang.",
        "date": "June 3, 2023",
        "location": "WA UNI ITY COLLEGE",
        "time": "9:00 PM EST"
    },
    {
        "title": "Alumni Reunion 2023: ARCHTCTR LNDSCP DSGN",
        "summary": "Join us for an engaging and enlightening info session with guest Nancy Wu.",
        "date": "June 3, 2023",
        "location": null,
        "time": "9:00 PM EST"
    },
    {
        "title": "Alumni Reunion 2023: Info Session with Guest Joyce Wu",
        "summary": "Join us for an engaging and enlightening info session with guest Joyce Wu. The event is part of the Alumni Reunion 2023.",
        "date": "June 3, 2023",
        "location": null,
        "time": "9:00 PM EST"
    },
    {
        "title": "Alumni Reunion 2023: Meet Jasmine Li",
        "summary": "Join us for an engaging and enlightening info session with guest Jasmine Li.",
        "date": "June 3, 2023",
        "location": null,
        "time": "9:00 PM EST"
    },
    {
        "title": "Alumni Reunion 2023: ARCHTCTR LNDSCP DSGN",
        "summary": "Join us for an engaging and enlightening info session with guest Yvonne Zhang.",
        "date": "June 3, 2023",
        "location": null,
        "time": "9:00 PM EST"
    },
    {
        "title": "RSUNION: Architecture & Visual Studies Info Session",
        "summary": "Join the RSUNION event to gain connections for your future career. This info session on June 3, 2023, at 9:00 PM EST is open to all students and enthusiasts interested in architecture and visual studies. Learn from industry experts, expand your knowledge, and network with like-minded individuals.",
        "date": "June 3, 2023",
        "time": "9:00 PM EST",
        "location": "Zoom (link coming soon)"
    },
    {
        "title": "Architecture Info Session for Daniels Students and Enthusiasts",
        "summary": "Join an engaging and enlightening info session to expand knowledge and gain insights for future careers. Learn from architecture industry experts and connect with like-minded individuals. Open to all students and enthusiasts.",
        "date": "June 3, 2023",
        "time": "9:00 PM EST",
        "location": "Zoom (link coming soon)"
    },
    {
        "title": "Final Season Showcase at AOA Studio",
        "date": null,
        "location": "AOA Studio",
        "time": null,
        "summary": "Join us at AOA Studio for the final season showcase where you can get your project featured and share your ideas with the world. We are excited to showcase your projects to a global audience. Use @aoastudio_official and #aoastudentwork to get featured."
    }
]